# Brewfile - curated package manifest for `brew bundle`.
# Install: `brew bundle` (or `just brew-install`). Drift check: `just brew-diff`.
# This list is curated, not a full machine dump - add new tools intentionally.

# Taps (for the tap-qualified formulae below)
tap "heroku/brew"
tap "unused-code/formulae"
tap "wpscanteam/tap"

# Formulae
brew "age"
brew "agg"
brew "aichat"
brew "aircrack-ng"
brew "ansible"
brew "argocd"
brew "asciinema"
brew "automake"
brew "awscli"
brew "bat"
brew "bfg"
brew "bison"
brew "blueutil"
brew "chafa"
brew "cliclick"
brew "cmake"
brew "coreutils"
brew "dive"
brew "docker"
brew "dog"
brew "duf"
brew "exiftool"
brew "eza"
brew "fastlane"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "glab"
brew "glances"
brew "glow"
brew "gnu-sed"
brew "go"
brew "goaccess"
brew "goreleaser"
brew "graphviz"
brew "gsmartcontrol"
brew "hadolint"
brew "helm"
brew "heroku/brew/heroku"
brew "htop"
brew "httpie"
brew "httpstat"
brew "imagemagick"
brew "jless"
brew "jp2a"
brew "jq"
brew "just"
brew "k9s"
brew "kamal"
brew "kompose"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "lolcat"
brew "lsd"
brew "minikube"
brew "mitmproxy"
brew "moreutils"
brew "mysql-client"
brew "nano"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "nnn"
brew "node"
brew "nyancat"
brew "opentofu"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "pre-commit"
brew "pv"
brew "qrencode"
brew "ranger"
brew "rbenv"
brew "rbspy"
brew "rclone"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "silicon"
brew "sops"
brew "telnet"
brew "terminal-notifier"
brew "terraformer"
brew "tfenv"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "trufflehog"
brew "ttyd"
brew "unused-code/formulae/unused"
brew "vegeta"
brew "watch"
brew "wget"
brew "wpscanteam/tap/wpscan"
brew "wrk"
brew "yamllint"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zplug"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "alt-tab"
cask "anki"
cask "audacity"
cask "bambu-studio"
cask "beekeeper-studio"
cask "betterdisplay"
cask "bitwarden"
cask "bruno"
cask "calibre"
cask "charles"
cask "claude"
cask "claude-code@latest"
cask "cog"
cask "coolterm"
cask "cursor"
cask "cyberduck"
cask "docker-desktop"
cask "eqmac"
cask "firefox"
cask "flameshot"
cask "flowvision"
cask "flux"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "hazeover"
cask "iina"
cask "keka"
cask "linearmouse"
cask "maccy"
cask "monitorcontrol"
cask "ngrok"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "phoenix-slides"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "secretive"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "stretchly"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-app"
cask "zed"
