age
aircrack-ng
ansible
argocd
asciinema
autojump
automake
bat
bfg
bison
blueutil
bruno
cliclick
cmake
coreutils
dive
dog
duf
eza
fd
ffmpeg
fzf
gh
gifsicle
git
git-delta
glances
glow
go
goaccess
graphviz
gsed
gsmartcontrol
hadolint
hashicorp/tap/terraform
helm
heroku/brew/heroku
htop
httpie
httpstat
imagemagick
imagemagick@6
jesseduffield/lazydocker/lazydocker
jesseduffield/lazygit/lazygit
jless
jp2a
jq
just
k9s
kamal
kubectl
libpq
lolcat
lsd
minikube
mitmproxy
moreutils
mysql-client
nano
ncdu
neofetch
neovim
nghttp2
nnn
node
nyancat
opentofu
pandoc
pipx
pnpm
poetry
postgresql
pre-commit
pv
qrencode
ranger
rbenv
rbspy
rclone
reattach-to-user-namespace
redis
ripgrep
sd
silicon
sops
telnet
terminal-notifier
terraformer
tfenv
the_silver_searcher
thefuck
tldr
tmux
tokei
tree
trufflehog
ttyd
unused-code/formulae/unused
vegeta
watch
wget
wpscanteam/tap/wpscan
wrk
yamllint
yq
yt-dlp
zoxide
zplug
zsh-history-substring-search
zsh-syntax-highlighting
