alacritty
alt-tab
anki
audacity
bambu-studio
beekeeper-studio
betterdisplay
bitwarden
bruno
calibre
charles
claude
cog
coolterm
cursor
cyberduck
docker
eqmac
firefox
flameshot
flowvision
flux
font-hack-nerd-font
google-chrome
hammerspoon
hazeover
iina
keka
linearmouse
maccy
monitorcontrol
ngrok
nordvpn
obs
obsidian
phoenix-slides
qbittorrent
raycast
rectangle
signal
spotify
stats
stretchly
telegram
the-unarchiver
vlc
wireshark
zed
